#+title: Checking health of RSS feeds
#+subtitle: Lets clean out the old stuff
#+date: 2020-06-19
#+tags: ruby, script
#+draft: true

I still use RSS feeds as my main way of consuming stuff on the
internet.  Old school.  I was looking at the list of things that I've
subscribed to which has been imported back from the Google Reader
days, and figured I'd do some exploration of ye old OPML file.

* Look at domains
First, lets see what we can find out about the machine that hosts the
feed. First we see if the hostname resolves, then we pull out the
domain from the hostname to see when it was registered.


#+begin_src ruby :tangle load_dns.rb :results output
  require 'resolv'
  require 'domainator'
  require 'whois'
  require 'whois-parser'

  def load_dns feed_url
    uri = URI.parse feed_url
  
    info = {}
    info[:hostname] = uri.hostname
  
    # See if the name is still on the internet
    info[:resolved] = Resolv.getaddress uri.hostname
  
    # Find the domain from the url
    info[:domain] = Domainator.parse(feed_url)
  
    # Lookup whois to see how old it is
    client = Whois::Client.new
    record = client.lookup(info[:domain])
    result = record.parser
  
    info[:registered] = result.registered?
    info[:created_on] = result.created_on
    info[:updated_on] = result.updated_on
    info[:expires_on] = result.expires_on
  
    info
  end

  if $PROGRAM_NAME == __FILE__
    pp load_dns( "https://codex.happyfuncorp.com/feed" )
    pp load_dns( "https://aestheticsofjoy.com/feed" )
  end
#+end_src

#+RESULTS:
#+begin_example
{:hostname=>"codex.happyfuncorp.com",
 :resolved=>"52.6.3.192",
 :domain=>"happyfuncorp.com",
 :registered=>true,
 :created_on=>2010-10-27 19:39:32 UTC,
 :updated_on=>2019-10-12 12:39:11 UTC,
 :expires_on=>2020-10-27 19:39:32 UTC}
{:hostname=>"aestheticsofjoy.com",
 :resolved=>"104.31.75.74",
 :domain=>"aestheticsofjoy.com",
 :registered=>true,
 :created_on=>2009-05-14 04:36:37 UTC,
 :updated_on=>nil,
 :expires_on=>2021-05-14 04:36:37 UTC}
#+end_example

So this domain has been around for a few years!  There's also
=.contacts= that we in theory could use, but poking around it seems like
things are wrapped up in privacy proxies for the most part.

